cfe llm/InformationRegisters/AI_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_Диалоги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификатоБеседыСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AI_РольСообщения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторБеседы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/InformationRegisters/AI_ШагиАгентскихОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_ШагиАгентскихОпераций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторШага</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерШага</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьМс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аргументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/Enums/AI_СтатусАгентскойОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_СтатусАгентскойОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗапрошена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Enums/AI_ТипAPI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ТипAPI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Responses</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ChatCompletions</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Enums/AI_РольСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_РольСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>system</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>user</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>assistant</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>tool</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/CommonModules/AI_АгентскиеОперацииСервер/Ext/Module.bsl
Процедура ВыполнитьОперацию(ИдентификаторОперации) Экспорт

	Попытка
		Если ОтменаЗапрошена(ИдентификаторОперации) Тогда
			ЗавершитьКакОтмененную(ИдентификаторОперации);
			Возврат;
		КонецЕсли;

		УстановитьСостояние(
			ИдентификаторОперации,
			Перечисления.AI_СтатусАгентскойОперации.Выполняется,
			"Подготовка контекста и параметров модели");
		ДанныеОперации = ПолучитьДанныеОперации(ИдентификаторОперации);

		ДополнительныйКонтекст = Новый Массив;
		Если ЗначениеЗаполнено(ДанныеОперации.ДанныеКонтекста) Тогда
			Контекст = Новый Структура(
				"ДанныеКонтекста,Наименование,ИдентификаторДляЛогики",
				ДанныеОперации.ДанныеКонтекста,
				"Данные запроса из базы",
				"ДанныеЗапросаИзБазы");
			ДополнительныйКонтекст.Добавить(Контекст);
		КонецЕсли;

		Если AI_Вложения.ЕстьВложенияОперации(ИдентификаторОперации) Тогда
			УстановитьСостояние(
				ИдентификаторОперации,
				Перечисления.AI_СтатусАгентскойОперации.Выполняется,
				"Подготовка вложений");
			РезультатАнализа = AI_Вложения.ПроанализироватьОперацию(
				ИдентификаторОперации,
				ДанныеОперации.Провайдер,
				ДанныеОперации.Модель,
				ДанныеОперации.ТипAPI,
				ДанныеОперации.Промт);
			ЗаписатьСтатистикуВложений(ИдентификаторОперации, РезультатАнализа);
			Если ЗначениеЗаполнено(РезультатАнализа.Контекст) Тогда
				КонтекстВложений = Новый Структура(
					"ДанныеКонтекста,Наименование,ИдентификаторДляЛогики",
					РезультатАнализа.Контекст,
					"Анализ пользовательских вложений",
					"АнализВложений");
				ДополнительныйКонтекст.Добавить(КонтекстВложений);
			КонецЕсли;
			Если ОтменаЗапрошена(ИдентификаторОперации) Тогда
				ЗавершитьКакОтмененную(ИдентификаторОперации);
				Возврат;
			КонецЕсли;
		КонецЕсли;

		Клиент = Обработки.AI_Клиент.Создать();
		Клиент.Инициализировать(
			ДанныеОперации.Провайдер,
			ДанныеОперации.Модель,
			ДанныеОперации.ТипAPI,
			ДанныеОперации.РежимДиалога,
			ДанныеОперации.ГлубинаДиалога);
		Клиент.ИнициализироватьСистемныйПромтПроизвольный(
			ДанныеОперации.СистемныйПромт,
			0.3,
			50000,
			Неопределено,
			Неопределено,
			ДополнительныйКонтекст,
			ДанныеОперации.Агент);
		Клиент.УстановитьИдентификаторАгентскойОперации(ИдентификаторОперации);

		Если ЗначениеЗаполнено(ДанныеОперации.ПредыдущийIDОтвета) Тогда
			Клиент.УстановитьПредыдущийIDОтвета(ДанныеОперации.ПредыдущийIDОтвета);
		КонецЕсли;
		Если ДанныеОперации.РежимДиалога
			И ДанныеОперации.ТипAPI <> Перечисления.AI_ТипAPI.Responses Тогда
			Клиент.ИдентификаторДиалога = ДанныеОперации.ИдентификаторДиалога;
		КонецЕсли;

		ЗафиксироватьЭтап(ИдентификаторОперации, "Обращение к модели");
		Клиент.Спросить(ДанныеОперации.Промт);

		Если ОтменаЗапрошена(ИдентификаторОперации) Тогда
			ЗавершитьКакОтмененную(ИдентификаторОперации, Клиент);
			Возврат;
		КонецЕсли;
		Если ЗначениеЗаполнено(Клиент.ОшибкаОбработки) Тогда
			ЗавершитьСОшибкой(ИдентификаторОперации, Клиент.ОшибкаОбработки, Клиент);
			Возврат;
		КонецЕсли;

		ТекстОтвета = ПолучитьТекстОтвета(Клиент);
		Если Не ЗначениеЗаполнено(ТекстОтвета) Тогда
			ЗавершитьСОшибкой(ИдентификаторОперации, "Модель вернула пустой ответ.", Клиент);
			Возврат;
		КонецЕсли;

		НовыйIDОтвета = "";
		Если ДанныеОперации.ТипAPI = Перечисления.AI_ТипAPI.Responses
			И ЗначениеЗаполнено(Клиент.ИдентификаторДиалога) Тогда
			НовыйIDОтвета = Строка(Клиент.ИдентификаторДиалога);
		КонецЕсли;

		Если ДанныеОперации.РежимДиалога
			И ДанныеОперации.ТипAPI = Перечисления.AI_ТипAPI.Responses Тогда
			ТекстПользователяДляИстории = ДанныеОперации.Промт
				+ AI_Вложения.ПредставлениеВложенийОперации(ИдентификаторОперации);
			РегистрыСведений.AI_Диалоги.ЗаписьСобытия(
				ДанныеОперации.ИдентификаторДиалога,
				Перечисления.AI_РольСообщения.user,
				ТекстПользователяДляИстории,
				ДанныеОперации.ИдентификаторСообщения);
			РегистрыСведений.AI_Диалоги.ЗаписьСобытия(
				ДанныеОперации.ИдентификаторДиалога,
				Перечисления.AI_РольСообщения.assistant,
				ТекстОтвета);
		КонецЕсли;

		Запись = ПолучитьМенеджерОперации(ИдентификаторОперации);
		Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Завершена;
		Запись.ТекущийЭтап = "Ответ получен";
		Запись.Результат = ТекстОтвета;
		Запись.ТекстОшибки = "";
		Запись.НовыйIDОтвета = НовыйIDОтвета;
		ЗаполнитьТокены(Запись, Клиент);
		ОбновитьВерсиюИЗаписать(Запись);
	Исключение
		ЗавершитьСОшибкой(
			ИдентификаторОперации,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			Клиент);
	КонецПопытки;

КонецПроцедуры

Процедура ЗафиксироватьЭтап(ИдентификаторОперации, ТекстЭтапа) Экспорт

	Если Не ЗначениеЗаполнено(ИдентификаторОперации) Тогда
		Возврат;
	КонецЕсли;
	Запись = ПолучитьМенеджерОперации(ИдентификаторОперации);
	Если ЭтоФинальныйСтатус(Запись.Статус) Тогда
		Возврат;
	КонецЕсли;
	Запись.ТекущийЭтап = Лев(Строка(ТекстЭтапа), 150);
	ОбновитьВерсиюИЗаписать(Запись);

КонецПроцедуры

Функция ЗафиксироватьНачалоШага(ИдентификаторОперации, НомерШага, Инструмент, Аргументы) Экспорт

	Если Не ЗначениеЗаполнено(ИдентификаторОперации) Тогда
		Возврат Неопределено;
	КонецЕсли;
	ЗаписьОперации = ПолучитьМенеджерОперации(ИдентификаторОперации);
	ЗаписьОперации.ПоследнийНомерШага = ЗаписьОперации.ПоследнийНомерШага + 1;
	ПорядковыйНомер = ЗаписьОперации.ПоследнийНомерШага;
	ЗаписьОперации.ТекущийЭтап = "Выполняется инструмент: " + Лев(Строка(Инструмент), 110);
	ОбновитьВерсиюИЗаписать(ЗаписьОперации);

	ИдентификаторШага = Новый УникальныйИдентификатор;
	ЗаписьШага = РегистрыСведений.AI_ШагиАгентскихОпераций.СоздатьМенеджерЗаписи();
	ЗаписьШага.ИдентификаторОперации = ИдентификаторОперации;
	ЗаписьШага.ИдентификаторШага = ИдентификаторШага;
	ЗаписьШага.ПорядковыйНомер = ПорядковыйНомер;
	ЗаписьШага.НомерШага = НомерШага;
	ЗаписьШага.Инструмент = Лев(Строка(Инструмент), 100);
	ЗаписьШага.Статус = "Выполняется";
	ЗаписьШага.ДатаНачала = ТекущаяДатаСеанса();
	ЗаписьШага.Аргументы = Аргументы;
	ЗаписьШага.Записать();
	Возврат ИдентификаторШага;

КонецФункции

Процедура ЗавершитьШаг(
		ИдентификаторОперации,
		ИдентификаторШага,
		Успешно,
		ДлительностьМс,
		Результат) Экспорт

	Если Не ЗначениеЗаполнено(ИдентификаторОперации)
		Или Не ЗначениеЗаполнено(ИдентификаторШага) Тогда
		Возврат;
	КонецЕсли;
	ЗаписьШага = РегистрыСведений.AI_ШагиАгентскихОпераций.СоздатьМенеджерЗаписи();
	ЗаписьШага.ИдентификаторОперации = ИдентификаторОперации;
	ЗаписьШага.ИдентификаторШага = ИдентификаторШага;
	ЗаписьШага.Прочитать();
	ЗаписьШага.Статус = ?(Успешно, "Выполнено", "Ошибка");
	ЗаписьШага.ДатаОкончания = ТекущаяДатаСеанса();
	ЗаписьШага.ДлительностьМс = Макс(0, ДлительностьМс);
	ЗаписьШага.Результат = Результат;
	ЗаписьШага.Записать();
	ЗафиксироватьЭтап(ИдентификаторОперации, "Обработка результата инструмента");

КонецПроцедуры

Процедура ЗафиксироватьЗавершенныйШаг(
		ИдентификаторОперации,
		НомерШага,
		Инструмент,
		Успешно,
		ДлительностьМс,
		Аргументы,
		Результат) Экспорт

	ИдентификаторШага = ЗафиксироватьНачалоШага(
		ИдентификаторОперации,
		НомерШага,
		Инструмент,
		Аргументы);
	ЗавершитьШаг(
		ИдентификаторОперации,
		ИдентификаторШага,
		Успешно,
		ДлительностьМс,
		Результат);

КонецПроцедуры

Функция ОтменаЗапрошена(ИдентификаторОперации) Экспорт

	Если Не ЗначениеЗаполнено(ИдентификаторОперации) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| 	Операции.ОтменаЗапрошена КАК ОтменаЗапрошена
		|ИЗ
		| 	РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		| 	Операции.ИдентификаторОперации = &ИдентификаторОперации";
	Запрос.УстановитьПараметр("ИдентификаторОперации", ИдентификаторОперации);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий() И Выборка.ОтменаЗапрошена;

КонецФункции

Функция ПолучитьДанныеОперации(ИдентификаторОперации)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| 	Операции.ИдентификаторДиалога КАК ИдентификаторДиалога,
		| 	Операции.ИдентификаторСообщения КАК ИдентификаторСообщения,
		| 	Операции.Провайдер КАК Провайдер,
		| 	Операции.Модель КАК Модель,
		| 	Операции.Агент КАК Агент,
		| 	Операции.ТипAPI КАК ТипAPI,
		| 	Операции.Промт КАК Промт,
		| 	Операции.СистемныйПромт КАК СистемныйПромт,
		| 	Операции.ДанныеКонтекста КАК ДанныеКонтекста,
		| 	Операции.РежимДиалога КАК РежимДиалога,
		| 	Операции.ГлубинаДиалога КАК ГлубинаДиалога,
		| 	Операции.ПредыдущийIDОтвета КАК ПредыдущийIDОтвета
		|ИЗ
		| 	РегистрСведений.AI_АгентскиеОперации КАК Операции
		|ГДЕ
		| 	Операции.ИдентификаторОперации = &ИдентификаторОперации";
	Запрос.УстановитьПараметр("ИдентификаторОперации", ИдентификаторОперации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение "Агентская операция не найдена.";
	КонецЕсли;
	Возврат Выборка;

КонецФункции

Функция ПолучитьМенеджерОперации(ИдентификаторОперации)

	Запись = РегистрыСведений.AI_АгентскиеОперации.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторОперации = ИдентификаторОперации;
	Запись.Прочитать();
	Возврат Запись;

КонецФункции

Процедура УстановитьСостояние(ИдентификаторОперации, Статус, ТекстЭтапа)

	Запись = ПолучитьМенеджерОперации(ИдентификаторОперации);
	Запись.Статус = Статус;
	Запись.ТекущийЭтап = ТекстЭтапа;
	ОбновитьВерсиюИЗаписать(Запись);

КонецПроцедуры

Процедура ЗавершитьКакОтмененную(ИдентификаторОперации, Клиент = Неопределено)

	Запись = ПолучитьМенеджерОперации(ИдентификаторОперации);
	Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Отменена;
	Запись.ТекущийЭтап = "Операция отменена";
	Запись.ТекстОшибки = "Операция отменена пользователем.";
	Если Клиент <> Неопределено Тогда
		ЗаполнитьТокены(Запись, Клиент);
	КонецЕсли;
	ОбновитьВерсиюИЗаписать(Запись);

КонецПроцедуры

Процедура ЗавершитьСОшибкой(ИдентификаторОперации, ТекстОшибки, Клиент = Неопределено)

	Попытка
		Запись = ПолучитьМенеджерОперации(ИдентификаторОперации);
		Запись.Статус = Перечисления.AI_СтатусАгентскойОперации.Ошибка;
		Запись.ТекущийЭтап = "Ошибка выполнения";
		Запись.ТекстОшибки = Строка(ТекстОшибки);
		Если Клиент <> Неопределено Тогда
			ЗаполнитьТокены(Запись, Клиент);
		КонецЕсли;
		ОбновитьВерсиюИЗаписать(Запись);
	Исключение
		ЗаписьЖурналаРегистрации(
			"AI.АгентскиеОперации",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			"Не удалось сохранить ошибку агентской операции: " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

Процедура ЗаполнитьТокены(Запись, Клиент)

	Запись.ВходящиеТокены = Клиент.ВходящиеТокены;
	Запись.ВыходящиеТокены = Клиент.ВыходящиеТокены;
	Запись.ТокеныИнструментов = Клиент.ТулТокены;

КонецПроцедуры

Процедура ЗаписатьСтатистикуВложений(ИдентификаторОперации, РезультатАнализа)

	Запись = ПолучитьМенеджерОперации(ИдентификаторОперации);
	Запись.ВходящиеТокеныВложений = РезультатАнализа.ВходящиеТокены;
	Запись.ВыходящиеТокеныВложений = РезультатАнализа.ВыходящиеТокены;
	Запись.КоличествоВложений = РезультатАнализа.Количество;
	ОбновитьВерсиюИЗаписать(Запись);

КонецПроцедуры

Функция ПолучитьТекстОтвета(Клиент)

	ТекстОтвета = Клиент.ИзвлеченныйОтвет;
	Если ТекстОтвета = Неопределено Тогда
		Клиент.ПреобразоватьОтветВСтроку();
		ТекстОтвета = Клиент.Ответ;
	КонецЕсли;
	Возврат Строка(ТекстОтвета);

КонецФункции

Процедура ОбновитьВерсиюИЗаписать(Запись)

	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Версия = Запись.Версия + 1;
	Запись.Записать();

КонецПроцедуры

Функция ЭтоФинальныйСтатус(Статус)

	Возврат Статус = Перечисления.AI_СтатусАгентскойОперации.Завершена
		Или Статус = Перечисления.AI_СтатусАгентскойОперации.Ошибка
		Или Статус = Перечисления.AI_СтатусАгентскойОперации.Отменена;

КонецФункции
